<!-- html部分 -->
<template>
	<div id="fff">
		<h1>企业能耗比对比图</h1>
		<ve-line :data="chartData1"></ve-line>
		<h1>企业作业量对比图</h1>
		<ve-histogram :data="chartData2"></ve-histogram>
		<h1>企业耗电量对比图</h1>
		<ve-histogram :data="chartData2"></ve-histogram>
		<h1>企业耗水量对比图</h1>
		<ve-histogram :data="chartData2"></ve-histogram>
		<h1>企业耗油量对比图</h1>
		<ve-histogram :data="chartData2"></ve-histogram>
		<h1>设备完好率对比图</h1>
		<ve-histogram :data="chartData2"></ve-histogram>
	</div>
</template>
<!-- js部分 -->
<script>
	export default {
		name:'fff',
		data() {
			return {
				 chartData1: {
					  columns: ['日期', '访问用户', '下单用户', '下单率'],
					  rows: [
						{ '日期': '1/1', '访问用户': 1393, '下单用户': 1093, '下单率': 0.32 },
						{ '日期': '1/2', '访问用户': 3530, '下单用户': 3230, '下单率': 0.26 },
						{ '日期': '1/3', '访问用户': 2923, '下单用户': 2623, '下单率': 0.76 },
						{ '日期': '1/4', '访问用户': 1723, '下单用户': 1423, '下单率': 0.49 },
						{ '日期': '1/5', '访问用户': 3792, '下单用户': 3492, '下单率': 0.323 },
						{ '日期': '1/6', '访问用户': 4593, '下单用户': 4293, '下单率': 0.78 }
					  ]
					},
					chartData2: {
						  columns: ['日期', '访问用户', '下单用户', '下单率'],
						  rows: [
							{ '日期': '1/1', '访问用户': 1393, '下单用户': 1093, '下单率': 0.32 },
							{ '日期': '1/2', '访问用户': 3530, '下单用户': 3230, '下单率': 0.26 },
							{ '日期': '1/3', '访问用户': 2923, '下单用户': 2623, '下单率': 0.76 },
							{ '日期': '1/4', '访问用户': 1723, '下单用户': 1423, '下单率': 0.49 },
							{ '日期': '1/5', '访问用户': 3792, '下单用户': 3492, '下单率': 0.323 },
							{ '日期': '1/6', '访问用户': 4593, '下单用户': 4293, '下单率': 0.78 }
						  ]
						}
			};
		},
		methods:{
			
		}
	}
</script>
<!-- css部分 -->
<style>

</style>
